# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "buo/cask-upgrade"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: false

# CLI Global utilities
brew 'coreutils'
brew 'docker-compose'
brew 'ffmpeg'
brew 'gnupg'
brew 'htop'
brew 'jq'
brew 'git'
brew 'git-delta'
brew 'mas' # Mac App Store
brew 'trash'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'yt-dlp'

# CLI Dev stuff

# brew 'awscli'
# cask 'google-cloud-sdk'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv-virtualenv'
# brew 'terraform'

# APPLICATIONS

cask 'appcleaner'
# cask "android-file-transfer"
cask 'battle-net'
cask 'bitwarden'
brew 'bitwarden-cli'
cask 'coconutbattery'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'keycastr' # Keystroke for screencast
cask 'notion'
# brew "ollama" # Easily run LLM models
mas "PDFGear", id: 6469021132
cask 'postico' # SQL
cask 'postman'
cask 'protonvpn'
cask 'raycast'
mas 'Slack', id: 803453959
cask 'redisinsight' # REDIS
cask 'signal'
cask 'spotify'
cask 'sourcetree'
cask 'steam'
cask 'stremio'
mas 'The Unarchiver', id: 425424353
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
# brew "watchman" # For React Native dev
mas 'wireguard', id: 1451685025
mas 'Xcode', id: 497799835
# cask "zoom"

# FONTS

# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
