# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew' 

# Install CLI Tools
## Shell Utilities
brew 'coreutils'
brew 'findutils'
brew 'autojump'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'jq'
brew 'q'
brew 'docker-compose'
brew 'ack'

## Network Utilities
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

## System Utilities
brew 'terminal-notifier'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'

## Dev Utilities
brew 'diff-so-fancy'
brew 'heroku'
brew 'reattach-to-user-namespace'
brew 'git'
brew 'awscli'
brew 'w3m'
brew 'nvm'
brew 'node'

# Mac Apps
## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'alfred'
cask 'go2shell'
cask 'docker'
cask 'google-chrome'
cask 'rectangle'
cask 'keycastr'
cask 'clipy'
cask 'cheatsheet'

## System
cask 'skitch'
cask 'the-unarchiver'
cask 'coconutbattery'
cask 'appcleaner'
cask 'namechanger'

## Editor
cask 'visual-studio-code'
cask 'macdown'
brew 'vim', args: ["--with-lua"]

## Development
cask 'atext'
cask 'diffmerge'
cask 'fastlane'
cask 'firefox'
cask 'gas-mask'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'java8'
cask 'microsoft-remote-desktop-beta'
cask 'ngrok'
cask 'opera'
cask 'postman'
cask 'robo-3t'
cask 'sequel-pro'
cask 'psequel'
cask 'sourcetree'

# Finder Quicklook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-csv' #++
cask 'jupyter-notebook-ql' #++

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# App
mas 'XCode', id: 497799835